app/views/user_categories/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_category_id" = ?  [["user_category_id", 29]]
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d', tasks.modified_at) AS strftime_y_m_d_tasks_modified_at FROM "tasks" WHERE "tasks"."user_category_id" = ? AND "tasks"."status" = ? GROUP BY strftime('%Y-%m-%d', tasks.modified_at)  [["user_category_id", 1], ["status", "completed"]]
---
<!-- <div class="container container-fluid task-list "> -->
<% if @user_category.tasks.where(status: "incomplete").empty? %>