app/views/users/show.html.erb

SELECT "user_categories".* FROM "user_categories" WHERE "user_categories"."user_id" = ?  [["user_id", 4]]
---
  <div class="row centered">
    <% @user.user_categories.each do |user_category|%>

SELECT "tasks".* FROM "tasks" INNER JOIN "user_categories" ON "tasks"."user_category_id" = "user_categories"."id" WHERE "user_categories"."category_id" = ?  [["category_id", 1]]
---
        <h4><%= link_to user_category.category.name, user_user_category_path(@user, user_category) %></h4>
          <% user_category.tasks.each do |task|%>