app/views/users/show.html.erb

  <div class="row centered">
    <% @user.categories.each do |category|%>
---
SELECT "categories".* FROM "categories" INNER JOIN "user_categories" ON "categories"."id" = "user_categories"."category_id" WHERE "user_categories"."user_id" = ?  [["user_id", 2]]