app/views/users/show.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_category_id" = ? AND "tasks"."status" = ?  [["user_category_id", 29], ["status", "incomplete"]]
---
      <div class="col-xs-12 col-sm-6 col-md-4 col-lg-4 categories" id="category-<%= user_category.category_id %>">
        <h4><%= link_to user_category.category.name, user_user_category_path(@user, user_category) %><span class="tag tag-default tag-pill pull-right"><%= user_category.tasks.where(status: "incomplete").count%></span></h4>