app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @entry = Entry.all

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @user = current_user
    @entry = Entry.find(params[:id])

SELECT  "user_categories".* FROM "user_categories" WHERE "user_categories"."user_id" = ? AND "user_categories"."category_id" = ? LIMIT 1  [["user_id", 3], ["category_id", 5]]
INSERT INTO "entries" ("title", "description", "user_category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "take an inch"], ["description", ""], ["user_category_id", 14], ["created_at", "2016-07-19 14:47:25.114052"], ["updated_at", "2016-07-19 14:47:25.114052"]]
---
  def create
    @user = current_user
    @entry = Entry.new(entry_params)
    @user_category = UserCategory.find_by({user_id: params[:user_id],category_id: params[:category_id]})
    @entry.user_category = @user_category
    @entry.save

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "entries" SET "status" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["status", "completed"], ["updated_at", "2016-07-21 16:23:29.982932"], ["id", 7]]
---
  def update
    # byebug
    @user = current_user
    @entry = Entry.find(params[:id])
    @entry.update(entry_params)

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 10]]
---
  def destroy
    @user = current_user
    @entry = Entry.find(params[:id])
    @entry.destroy