app/controllers/stats_controller.rb

SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d', tasks.created_at) AS strftime_y_m_d_tasks_created_at FROM "tasks" GROUP BY strftime('%Y-%m-%d', tasks.created_at)
---
  def index
    @user = current_user
    @task = Task.new
    @dashboard = Dashboard.new
    @category_with_most_tasks = Category.with_most_tasks
    @category_with_most_completed_tasks = Category.with_most_completed_tasks
    @category_with_most_abandoned_tasks = Category.with_most_abandoned_tasks
    @total_number_of_tasks= Task.count