app/controllers/tasks_controller.rb

SELECT  "user_categories".* FROM "user_categories" WHERE "user_categories"."user_id" = ? AND "user_categories"."category_id" = ? LIMIT 1  [["user_id", 3], ["category_id", 0]]
INSERT INTO "tasks" ("title", "description", "user_category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "love it"], ["description", ""], ["user_category_id", 11], ["created_at", "2016-08-17 17:33:16.237824"], ["updated_at", "2016-08-17 17:33:16.237824"]]
---
  def create
    # binding.pry
    @user = current_user
    @task = Task.new(task_params)
    @user_category = UserCategory.find_by({user_id: params[:user_id],category_id: params[:category_id]})
    @task.user_category = @user_category
    @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 31]]
UPDATE "tasks" SET "modified_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["modified_at", "2016-08-17 18:26:42.269150"], ["updated_at", "2016-08-17 18:26:42.270072"], ["id", 19]]
---
  def update
    @user = current_user
    @task = Task.find(params[:id])
    @user_category = @task.user_category
    @task.update_and_modify!(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 22]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 22]]
---
  def destroy
    @user = current_user
    @task = Task.find(params[:id])
    @user_category = @task.user_category
    @task.destroy