app/controllers/users_controller.rb

INSERT INTO "user_categories" ("category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["user_id", 2], ["created_at", "2016-07-14 16:05:08.955525"], ["updated_at", "2016-07-14 16:05:08.955525"]]
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new_with_categories(user_params)

    if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$jzsB84T8ILHMXtdOFf7kMO0lzphNrCjxjX6JQALslJ36Sf7rwINti"], ["updated_at", "2016-07-12 16:48:26.811611"], ["id", 1]]
---
  def update
    @user = current_user
    @user.update(user_params)