app/controllers/user_categories_controller.rb

  def show
    # @task = Task.new
    # binding.pry
    @user = current_user
    @user_category = UserCategory.find(params[:id])
---
SELECT "user_categories".* FROM "user_categories" WHERE "user_categories"."user_id" = ?  [["user_id", 1]]