app/views/stats/index.html.erb

  <% end %>
  <p>The total number of tasks created is <%= @user.tasks.count %></p>
---
SELECT COUNT(*) AS count_all, categories.name AS categories_name FROM "tasks" INNER JOIN "user_categories" "user_categories_tasks" ON "user_categories_tasks"."id" = "tasks"."user_category_id" INNER JOIN "categories" ON "categories"."id" = "user_categories_tasks"."category_id" INNER JOIN "user_categories" ON "tasks"."user_category_id" = "user_categories"."id" WHERE "user_categories"."user_id" = ? GROUP BY categories.name  [["user_id", 4]]

<div class="m-b-50-px">
<%= pie_chart @user.tasks.joins(:user_category => [:category]).group('categories.name').count %>
---
SELECT  "categories".* FROM "categories" INNER JOIN "user_categories" ON "user_categories"."category_id" = "categories"."id" INNER JOIN "entries" ON "entries"."user_category_id" = "user_categories"."id" WHERE (status = 'completed') GROUP BY "categories"."id"  ORDER BY count(*) desc LIMIT 1


<% if !@user.tasks.empty?%>
<h3 class="text-center m-t-50-px m-b-50-px">Tasks lifecycle</h3>
  <%= line_chart [
    {name: "Tasks created", data: @user.tasks.group("strftime('%Y-%m-%d', tasks.created_at)").count},
    {name: "Tasks completed", data: @user.tasks.where(status: "completed").group("strftime('%Y-%m-%d', tasks.modified_at)").count},
    {name: "Tasks abandoned", data: @user.tasks.where(status: "abandoned").group("strftime('%Y-%m-%d', tasks.modified_at)").count}
  ] %>
---
SELECT  1 AS one FROM "tasks" INNER JOIN "user_categories" ON "tasks"."user_category_id" = "user_categories"."id" WHERE "user_categories"."user_id" = ? LIMIT 1  [["user_id", 5]]
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d', tasks.modified_at) AS strftime_y_m_d_tasks_modified_at FROM "tasks" INNER JOIN "user_categories" ON "tasks"."user_category_id" = "user_categories"."id" WHERE "user_categories"."user_id" = ? AND "tasks"."status" = ? GROUP BY strftime('%Y-%m-%d', tasks.modified_at)  [["user_id", 4], ["status", "completed"]]